# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

Rake::Task['db:drop'].invoke
Rake::Task['db:create'].invoke
Rake::Task['db:migrate'].invoke

@brand_image_path = "public/uploads/brands/"
@product_image_path = "public/uploads/product/"
@avatar_path = "public/uploads/avatars/"

def brand_logo (file_name)
  File.open(File.join(Rails.root, @brand_image_path + file_name))
end

def product_image (file_name)
  File.open(File.join(Rails.root, @product_image_path + file_name))
end

def avatar(file_name)
  File.open(File.join(Rails.root, @avatar_path + file_name))
end

effects = ["Смягчение кожи", "Формула поддержки", "Антиоксидантное", "Регенерация кожи", "Увлажнение кожи", "Очищение", "Придает блеск волосам", "Тонизирует кожу", "Улучшает структуру волос", "Антивозрастное", "Питание кожи", "УФ защита кожи", "Укрепляет волосы", "Успокаивающее", "Противовоспалительное", "Заживляющее", "Защитная функция", "Укрепление ногтевой пластины", "Защищает волосы", "Смягчает кожу", "Стягивает поры", "Дезинфицирует", "Антисептическое", "Бактерицидное", "Против перхоти", "Противовирусное", "Антиакне", "Питание волосяных луковиц", "Противогрибковое", "Стимулирует рост волос", "Дезодорирующее", "Кондиционирует волосы", "Фиксация"]

effects.each do |effect|
  e = ActiveEffect.create!(name: effect)
end


skins = [
  {
    type: "Жирная кожа",
    about: "Блеск, пористость, частые угри и прыщи. Она имеет сероватый цвет. Плюсы такой кожи – она эластична, лучше увлажнена, хорошо защищена от действия окружающей среды благодаря пленке, которую создает жир, морщины на такой коже появляются позже, чем у обладательниц другого типа кожи."
  }, {
    type: "Сухая кожа",
    about: "Тонкая и нежная кожа, склонная к преждевременному старению, имеет низкую эластичность, часто шелушится, краснеет, трескается, воспаляется, на ней редко проявляются прыщи, но она сильно подвержена влиянию внешних факторов."
  }, {
    type: "Нормальная кожа",
    about: "Самый редкий тип. Кожа практически безупречная, в меру чувствительная, упругая, матовая, поры почти не видны. Со временем может появиться сухость, морщинки и трещины."
  }, {
    type: "Комбинированная кожа",
    about: "Этот тип распространен больше других, его особенность в том, что разные области на лице имеют разный тип кожи, например, на скулах кожа сухая, а на лбу, носу, подбородке — жирная. Эта кожа аллергична, склонна к прыщам и раздражениям."
  }, {
    type: "Чувствительня кожа",
    about: "Это кожа, которая из-за воздействий внешних факторов зудит, испытывает сухость, краснеет, воспаляется. Она плохо реагирует на применение агрессивных косметических средств. Такая кожа менее эластична и менее увлажнена, чем другие типы кожи, у нее слабые защитные свойства."
  }
]

skins.each do |skin|
  SkinType.create!(name: skin[:type], description: skin[:about])
end

users = [
  {
    email: "za.iz.pr@yandex.kz",
    password: BCrypt::Password.create("123456"),
    user_name: 'Лера',
    skin: "Сухая кожа",
    age: 20,
    avatar: "1.png"
  }, {
    email: "test@test.ru",
    password: BCrypt::Password.create("123456"),
    user_name: "Соня Мармеладова",
    skin: "Чувствительня кожа",
    age: 48,
    avatar: "2.png"
    }, {
      email: "admin@test.ru",
      password: BCrypt::Password.create("123456"),
      user_name: "ADMIN",
      }
  ]

users.each do |user|
  if user[:user_name] == "ADMIN"
    u = User.create!(email: user[:email], password: user[:password], encrypted_password: user[:password], admin: true)
  else
    u = User.create!(email: user[:email], password: user[:password], encrypted_password: user[:password], admin: false)
    pr = Profile.last
    pr.name = user[:user_name]
    pr.age = user[:age]
    skin = SkinType.find_by name: user[:skin]
    pr.skin_type_id = skin.id
    pr.avatar = avatar(user[:avatar])
    pr.save
  end
    #
    # puts "#{pr.name}, #{pr.age}, #{SkinType.find_by( name: pr.skin_type_id).name}"
  end

brands = [
  {
    name: "Lush",
    logo: brand_logo('lush.jpg'),
    description: "Мы покупаем ингредиенты для нашей косметики только у компаний, которые так же, как и мы не допускают испытаний на животных, считая, что испытывать косметику должны сами люди.",
    site: 'https://www.lushrussia.ru/',
    product: [{
      name: "Палитра эмоций",
      view: "Пудра для лица",
      about: "Естественная, полупрозрачная, ультра легкая, отражающая свет пудра для лица, которая подходит для всех типов кожи. Её можно использовать как завершающую часть макияжа или же использовать только её для натурального образа.",
      promist_effests: ['Фиксация'],
      image: product_image('lush/palitra.jpg'),
      structure: [
        {
          name: "Talc",
          allergen: false,
          description: "Природный минерал. Порошок обычно белого цвета реже желтоватый, серый, голубой или розовый. Жирный на ощупь, без запаха. Имеет невысокую кроющую способность Используется в качестве гидрофобного наполнителя в пудрах, румянах, сухих тенях для век. Может использоваться в качестве УФ фильтра.",
          effects: ["УФ защита кожи", "Смягчение кожи"]
        }, {
          name: "Fluorphlogopite",
          allergen: false,
          description: "Минеральный компонент, который может быть как синтетического, так и натурального происхождения. Производителями косметики он классифицируется как наполнитель",
          effects: ["Формула поддержки"]
        }, {
          name: "TAPIOCA STARCH",
          allergen: true,
          description: "В составе косметических средств по уходу за кожей оказывает смягчающее и выравнивающее действия, придает коже бархатистость. Крахмал делает кожу мягкой и нежной, восстанавливает защитный барьер и удерживает влагу. Топиковый крахмал использую для приготовления лечебных мазей и эмульсий.",
          effects: ["Антиоксидантное", "Регенерация кожи", "Увлажнение кожи", "Очищение", "Смягчение кожи"]
        }, {
          name: "SIMMONDSIA CHINENSIS (JOJOBA) WAX PEG-120 ESTERS",
          allergen: true,
          description: "Прозрачная вязкая бесцветная жидкость. Гидрофильная форма масла жожоба. Солюбилизатор масел. Применяется в средствах по уходу за волосами и кожей. Усиливает пенообразование, придает блеск и яркость волосам.",
          effects: ["Придает блеск волосам", "Очищение"]
        }
      ]
    }, {
      name: "Slap Stick 2N",
      view: "Твёрдая тональная основа",
      about: "Поприветствуйте кожу столь свежую, словно вы только что посетили СПА, и ингредиенты столь роскошные, что увлажняют, смягчают и омолаживают с каждым нанесением. С 40 оттенками в гамме (также в тёплом и нейтральном подтонах), чтобы удовлетворить потребности любого цвета лица, ваша кожа ещё никогда не чувствовала себя так хорошо.",
      promist_effests: ['Увлажнение кожи', "Смягчение кожи", "Питание кожи"],
      image: product_image('lush/tonal.jpg'),
      structure: [
        {
          name: "Tribehenin PEG-20 Esters",
          allergen: false,
          description: "Эмульгатор для системы масло в воде, подходит для большинства кремов. Обеспечивает особенно однородные дисперсии. Широкая совместимость с маслами, рН конкретных активных ингредиентов  Элегантная текстура и сливочный внешний вид.",
          effects: ["Смягчение кожи"]
        }, {
          name: "PEG-7 GLYCERYL COCOATE",
          allergen: false,
          description: "Мягкое, неионное ПАВ. Обладает превосходной моющей способностью. Значительно снижает раздражающее действие анионных ПАВ, в том числе лаурилсульфоэтоксилата натрия. Обладает пенорегулирующими свойствами. Безопасен для окружающей среды. Является альтернативой жирным этоксилированным спиртам.",
          effects: ["Очищение"]
        }, {
          name: "PEG-40 SORBITAN PEROLEATE",
          allergen: false,
          description: " ПАВ, эмульгатор. Повышает агдезию к коже, придает ощущение гладкости, препятствует высыханию воды в препаратах.",
          effects: ["Смягчение кожи", "Формула поддержки"]
        }, {
          name: "LECITHIN",
          allergen: true,
          description: "Гигроскопичное воскоподобное вещество. Гидрофильный коллоид. Основной структурный компонент мембран живых организмов. Оказывает выраженное действие на восстановление барьерных функций кожи, на процессы питания клеток, избавления их от шлаков.",
          effects: ["Антиоксидантное", "Смягчение кожи", "Тонизирует кожу"]
        }
      ]
    }]
  }, {
    name: "Lime Crime",
    logo: brand_logo('limecrime.jpg'),
    description: "Мы делаем красоту по-разному в известковом преступлении. Как культовый статус, цифровой макияж и цвет волос бренда, мы здесь, чтобы раскрыть то, что делает вас уникальным. Основанная визионером макияжа Doe Deere в 2008 году, наша миссия-создавать продукты и впечатления, которые переносят вас в волшебный мир, где вы можете выразить себя непримиримо, экспериментировать с каждым цветом радуги и избегать выглядеть как все остальные.",
    site: 'https://www.limecrime.com/',
    product: [{
      name: "Bushy Brow Gel",
      view: "Гель для бровей",
      about: "Коллекция гелей для бровей Bushy Brow Strong Hold Gel от Lime Crime моментально станет популярной у всех любительниц акцентированных дуг. С их помощью можно сконструировать собственную идеальную brow-модель, будь то популярные boyfriend brows или брови-оммаж Марлен Дитрих.",
      promist_effests: ["Фиксация"],
      image: product_image('limeCrime/brow.jpg'),
      structure: [{
        name: "Aqua",
        allergen: false,
        description: "Вода",
        effects: ["Формула поддержки"]
      }, {
        name: "VP/ VA COPOLYMER",
        allergen: false,
        description: "Вещество используется  в качестве фиксатора (помогает  удерживать форму укладки), пленкообразователя (сополимер образует тонкую пленку на волосах, а также коже и ногтях; таким образом препятствуя поглощению влаги). Кроме того, данный сополимер можно как вяжущее вещество, которое помагает удерживать вместе компоненты спрессованной таблетки или образовывать суспензии (суспендировать нерастворимые вещества в жидкости).",
        effects: ["Формула поддержки", "Фиксация"]
      }, {
        name: "PVP",
        allergen: false,
        description: "Смесь амфотерных линейных полимеров с варьирующей степенью вязкости. Белый гигроскопичный порошок. Растворяется в воде. Загуститель и гелеобразователь для кремов и зубных паст. Стабилизирует пену в моющих средствах. Образует блестящие прозрачные пленки, благодаря чему применяется в средствах по уходу за волосами.",
        effects: ["Придает блеск волосам"]
      }, {
        name: "1,2-HEXANEDIOL",
        allergen: false,
        description: "1,2 Гександиол является хорошим антисептиком. Он помогает поддерживать изначальный  уровень микробов и препятствует их размножению. Это помогает вашим средствам сохранять свои свойства без изменений в течение длительного времени. Кроме того, это свойство активно используется при изготовлении дезодорантов.",
        effects: ["Формула поддержки", "Антисептическое", "Увлажнение кожи"]
      }, {
        name: "CARBOMER",
        allergen: false,
        description: "Карбомер используют как дешевый структурообразователь, загуститель, он придаёт косметическим средствам необходимую вязкость",
        effects: ["Формула поддержки"]
      }]
    }, {
      name: "Hi-Lite",
      view: "Палетка для лица",
      about: "Палетка хайлайтеров Lime Crime Ha-Lite — это трехцветный набор сияющей пудры для любого повода и настроения. Стоит назвать хайлайтеры бескомпромиссным решением для всех любительниц оказываться в центре внимания. Каждая из пяти палеток Ha-Lite имеет свое название: Blossoms (оттенки здесь можно назвать весенними, нежными), Opals (использованы мистические оттенки сияния кристаллов), Mermaids (палетка посвящена подводному миру русалок), Unicorns (яркие хайлайтеры из мира радужных единорогов), Angels (оттенки пудры для нежных ангелов). Ha-Lite способен преобразить любую женщину, дав ей возможность для творчества с макияжем. Палетка хайлайтеров Lime Crime устойчива в использовании и имеет длительный срок хранения.",
      promist_effests: ["Фиксация"],
      image: product_image("limeCrime/hilite.jpg"),
      structure: [{
        name: "MICA",
        allergen: false,
        description: "Мика это природная слюда, которая окрашивается при помощи минеральных пигментов в разные оттенки. Варьируется и помол - мелкие частицы придают атласный блеск, а крупные частицы красиво искрятся. Мика, благодаря форме частиц, дает плотное покрытие и делает макияж очень стойким. Этот минеральный наполнитель позволяет получить большое разнообразие косметических средств и визуальных эффектов. Применяется для создания теней, тональных средств, помад.",
        effects: ["Формула поддержки"]
      }, {
        name: "ETHYLHEXYL PALMITATE",
        allergen: false,
        description: "Сложный эфир. Прозрачная, маслянистая, бесцветная жидкость при комнатной температуре. Хорошо смешивается с органическими жидкостями. Способствует повышению вязкости композиций. В косметических средствах используется в качестве соэмульгатора и маслозаменителя, растворителя, смачивателя, как фиксатор аромата. Придает коже ощущение гладкости и ухоженности. Применяется в качестве эмолента в средствах по уходу за кожей, детской косметике, солнцезащитных средствах, кондиционерах для волос. Широко применим в средствах макияжа, кремах для тела и загара.",
        effects: ["Кондиционирует волосы", "Смягчение кожи"]
      }, {
        name: "ZINC STEARATE",
        allergen: false,
        description: "Однородный тонкий, аморфный порошок белого или кремового цвета. Не растворяется в воде, низших спиртах. Анионное ПАВ. При нагревании растворяется в маслах. Используется в качестве наполнителя и гидрофобизирующего компонента в составе пудру (до 15%), а также структурообразовательи стабилизатор. В полиуретановых и нитроцеллюлозных лаках выступает в качестве выравнивающего агента.",
        effects: ["Формула поддержки"]
      }, {
        name: "SILICATE",
        allergen: false,
        description: "Соль кремниевой или поликремниевой кислоты. В средствах для волос – уменьшают спутывание влажных волос. В средствах для кожи – облегчают нанесение и распределение готового продукта, быстро улетучиваются с поверхности кожи, не вызывая охлаждающего эффекта.",
        effects: ["Формула поддержки"]
      }, {
        name: "PHENOXYETHANOL",
        allergen: true,
        description: "В парфюмерии используется как фиксатор. В косметике - как консервант. Эффективен против грамотрицательных бактерий, но слаб в отношении грибов и граммположительных бактерий. Как правило применяется в сочетании с парабенами. Согласно Регламенту ЕС входит в список консервантов разрешенных к применению в концентрации до 1%.",
        effects: ["Антисептическое", "Увлажнение кожи"]
      }, {
        name: "CAPRYLYL GLYCOL",
        allergen: true,
        description: "Эмолент с антимикробными свойствами. Применяется в качестве нетрадиционного мягкого консерванта, либо вещества усиливающего действие консерванта. В некоторых случаях заменяет метилпарабен. Применяется в косметики категории 'органик' и детской косметике.",
        effects: ["Антисептическое", "Формула поддержки"]
      }]
    }]
  }, {
    name: "L'loccitane",
    logo: brand_logo("l'occitane.jpg"),
    description: "Бренд L'OCCITANE был создан в 1976 году, когда его основатель Оливье Боссан начал дистиллировать эфирные масла и продавать их в своем любимом Провансе. Бренд, основанный на твердых принципах и подлинных историях, с тех пор неуклонно развивается, но его философия остается неизменной. Природа имеет значение. Люди имеют значение. Именно поэтому L'OCCITANE придерживается шести простых принципов, направленных на защиту нашей уникальной планеты и поддержание уважительного отношения к людям.",
    site: 'https://www.loccitane.ru/',
    product: [{
      name: "Immortelle Reset",
      view: "Крем",
      about: "Эликсир поможет восстановить вашу кожу во время сна, устранив последствия напряженного ритма повседневной жизни. Эффективное средство с золотыми микрокапсулами чудесным образом преображает лицо во время сна. Эликсир подготавливает кожу к нанесению других средств, способствуя их лучшему действию. Сама идея ночного обновления заключается в том, чтобы помочь коже избавиться от негативного воздействия окружающей среды. К утру кожа будет выглядеть отдохнувшей и останется такой на весь день.",
      promist_effests: ["Регенерация кожи", "Антивозрастное"],
      image: product_image("loccitane/crem.jpg"),
      structure: [{
        name: "Aqua",
        allergen: false,
        description: "Вода",
        effects: ["Формула поддержки"]
      }, {
        name: "PROPANEDIOL",
        allergen: true,
        description: "Гликоль, полученный из кукурузного сахара. Натуральная альтернатива традиционным гликолям - пропилегликолю, глицерину. В составе косметических средств пропандиол характеризуется увлажняющими свойствами, усиливает действие консервантов, выступает в качестве растворителя и носителя активных компонентов.",
        effects: ["Увлажнение кожи", "Формула поддержки"]
      }, {
        name: "Glycerin",
        allergen: true,
        description: "Глицерин способствует лучшему проникновению влаги в глубокие слои кожи, соэмульгатор и стабилизирует структуру косметических средств, смягчает агрессивные ПАВы, при этом повышает очищающие способности средства",
        effects: ["Увлажнение кожи", "Улучшает структуру волос", "Придает блеск волосам", "Смягчение кожи", "Формула поддержки"]
      }, {
        name: "ISONONYL ISONONANOATE",
        allergen: true,
        description: "Жидкость с приятным фруктово-цветочным запахом и вкусом. Содержится в какао-бобах, лавандовом эфирном масле. Используется в отдушках для губной помады и зубных пастах.",
        effects: ["Формула поддержки"]
      }, {
        name: "BUTYLENE GLYCOL",
        allergen: false,
        description: "Двухатомный спирт. Бесцветная вязкая низколетучая жидкость сладкого вкуса. Обладает хорошей влагоудерживающей способностью. В косметических изделиях часто применяется компонент, усиливающий действие других ингредиентов, например, отдушек, консервантов, увлажняющих добавок. Обладает хорошей антимикробной активностью, нетрадиционный консервант. Часто применяется в лаках для волос, средствах для укладки.",
        effects: ["Защищает волосы", "Формула поддержки"]
      }, {
        name: "PENTYLENE GLYCOL",
        allergen: true,
        description: "Многофункциональный увлажняющий и кондиционирующий ингредиент. Водорастворимая прозрачная бесцветная жидкость. Хороший растворитель. Стабилен в широком интервале температур и рН. Увеличивает биодоступность активных ингредиентов. Обладает антимикробной активностью, что позволяет снизить дозировку консервантов в рецептуре. Уменьшает размер частиц в эмульсии, способствуя их большей стабильности. Усиливает водостойкость солнцезащитных рецептур.",
        effects: ["Кондиционирует волосы", "Увлажнение кожи", "Формула поддержки"]
      }, {
        name: "DEXTRIN PALMITATE/ETHYLHEXANOATE",
        allergen: false,
        effects: ["Антивозрастное", "Питание кожи"]
      }]
    }, {
      name: "Shea Butter",
      view: "Бальзам для губ",
      about: "Нежный бальзам с тонким ароматом на основе масла карите восстанавливает и питает пересушенную кожу губ.",
      promist_effests: ["Регенерация кожи", "Питание кожи"],
      image: product_image("loccitane/lipstic.jpg"),
      structure: [{
        name: "SODIUM ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER",
        allergen: false,
        description: "Смесь синтетических веществ, регулирующих вязкость эмульсий, обеспечивает загущение водных растворов благодаря образованию сложной структуры. Способна формировать пленки на поверхности.",
        effects: ["Формула поддержки"]
      }, {
        name: "XANTHOMONAS CAMPESTRIS",
        allergen: false,
        description: "Ксантановая камедь это мелко-зернистый порошок цвета топленого молока. Ее получают ферментацией микроорганизмов, обитающих на растениях семейства капустные.Ксантановая камедь или ксантан (xanthan gum) является абсолютно безопасным и экологически чистым продуктом.Ксантановая камедь чаще всего используется в качестве загустителя. Даже при минимальной концентрации получается вязкий стабильный раствор. Ксантан растворяется в холодной и теплой воде, этиловом спирте и глицерине. При этом эмульсии с использованием этой камеди более густые в состоянии покоя, а при перемешивании становятся более жидкими.",
        effects: ["Защитная функция", "Противовоспалительное", "Увлажнение кожи", "Бактерицидное", "Формула поддержки"]
      }, {
        name: "ETHYLHEXYLGLYCERIN",
        allergen: false,
        description: "Моноалкильный эфир глицерина, бесцветная жидкость. Один из самых сильных 'зеленых' консервантов, по силе сравним с парабеновыми аналогами. Не выделяет формальдегид. Может использоваться в широком диапазоне рН. Получают из различных зерновых культур. В косметике рекомендован как многофункциональная добавка, представляющая из себя: смягчающую добавку в средствах для кожи; улучшающую тактильные ощущения эмульсии добавку; дезодорирующую добавку, активную против грамположительных бактерий. Усиливает активность других антимикробных средств, таких как гликоли и спирты. Эмолент, который способствует увлажнению кожи. Используется в качестве фиксатора аромата.",
        effects: ["Антисептическое", "Дезодорирующее", "Смягчает кожу", "Увлажнение кожи"]
      }, {
        name: "PHENOXYETHANOL",
        allergen: true,
        description: "В парфюмерии используется как фиксатор. В косметике - как консервант. Эффективен против грамотрицательных бактерий, но слаб в отношении грибов и граммположительных бактерий.",
        effects: ["Антисептическое", "Увлажнение кожи", "Формула поддержки"]
      }, {
        name: "CHLORPHENESIN",
        allergen: true,
        description: " Консервант, наиболее активен против грибков. Считается слабым консервантом. Действует лучше в системах с высокими концентрациями силиконов.",
        effects: ["Формула поддержки"]
      }, {
        name: "PROPYLENE GLYCOL",
        allergen: false,
        description: "Универсальный растворитель, используется во многих косметических средствах.",
        effects: ["Увлажнение кожи", "Формула поддержки"]
      }
    ]
    }]
  }, {
    name: "Skin food",
    logo: brand_logo('skinFood.png'),
    description: "Главный принцип SKINFOOD — «еда, которая полезна для здоровья, полезна и для кожи». Мы создаём косметику и средства для ухода за кожей из натуральных съедобных компонентов с использованием современных технологий.",
    site: 'http://skinfood-official.ru/',
    product: [{
      name: "Musk Scent",
      view: "Крем для рук",
      about: "Парфюмированный крем для рук SkinFood Shea Butter Perfumed Hand Cream с ароматом мускуса, содержит масло ши.",
      promist_effests: ["Смягчение кожи", "Увлажнение кожи", "Регенерация кожи"],
      image: product_image('skinFood/crem2.jpg'),
      structure: [{
        name: "Aqua",
        allergen: false,
        description: "Вода",
        effects: ["Формула поддержки"]
      }, {
        name: "Butyrospermum Parkii (Shea) Butter",
        allergen: false,
        description: "Жирное масло, получаемое из косточек плодов дерева каритэ. Имеет консистенцию сливочного масла и сохраняет ее при температуре до 35С. Имеет богатую текстуру, кремовый оттенок.",
        effects: [ "Улучшает структуру волос", "Антивозрастное", "Питание кожи", "УФ защита кожи", "Укрепляет волосы", "Успокаивающее", "Противовоспалительное", "Заживляющее", "Защитная функция", "Укрепление ногтевой пластины", "Регенерация кожи"]
      }, {
        name: "Caprylic/Capric Triglyceride",
        allergen: true,
        description: "Сложные эфиры глицерина с каприловой и каприковой кислотами, натуральные умягчители полученные из кокосового масла. Бесцветная прозрачная маслянистая жидкость. Не растворимы в воде, смешиваются с маслами. Смягчают кожу, не оставляя тяжелого жирного ощущения.",
        effects: ["Питание кожи", "Смягчает кожу", "Увлажнение кожи"]
      }, {
        name: "Glycerin",
        allergen: true,
        description: "Глицерин способствует лучшему проникновению влаги в глубокие слои кожи, соэмульгатор и стабилизирует структуру косметических средств, смягчает агрессивные ПАВы, при этом повышает очищающие способности средства",
        effects: ["Увлажнение кожи", "Улучшает структуру волос", "Придает блеск волосам", "Смягчение кожи", "Формула поддержки"]
      }, {
        name: "Butylene Glycol",
        allergen: false,
        description: "Двухатомный спирт. Бесцветная вязкая низколетучая жидкость сладкого вкуса. Обладает хорошей влагоудерживающей способностью. В косметических изделиях часто применяется компонент, усиливающий действие других ингредиентов, например, отдушек, консервантов, увлажняющих добавок. Обладает хорошей антимикробной активностью, нетрадиционный консервант. Часто применяется в лаках для волос, средствах для укладки.",
        effects: ["Защищает волосы", "Формула поддержки"]
      }, {
        name: "Cyclopentasiloxane",
        allergen: false,
        description: "При нанесении циклопентасилоксана на кожу и волосы, он после испарения оставляет после себя легкую водоотталкивающую защитную пленку. При этом кожа и волосы приобретают шелковистость и мягкость, без зажирнения и липкости, облегчается расчесывание волос. Так же он он может временно заполнять морщины, скрывая их, поэтому его можно видеть часто в составах средств от морщин.",
        effects: ["Защитная функция"]
      }, {
        name: "Cetearyl Alcohol",
        allergen: true,
        description: "Это белое воскообразное вещество, которое чем-то напоминает хлопья. Растворяется он в жирах и не растворяется в воде.",
        effects: ["Формула поддержки", "Смягчает кожу", "Стягивает поры", "Дезинфицирует", "Увлажнение кожи", "Улучшает структуру волос"]
      }]
    }, {
      name: "Royal Honey Essential Queen's",
      view: "Крем",
      about: "Серия для глубокого увлажнения кожи, изготовленная на основе меда, содержащего большое количество полезных витаминов и минералов за счет ферментации в течении 60 дней.",
      promist_effests: ["Увлажнение кожи", "Питание кожи"],
      image: product_image('skinFood/crem.jpg'),
      structure: [{
        name: "PROPOLIS EXTRACT",
        allergen: true,
        description: "Прополис один из ценнейших продуктов пчеловодства. Его химический состав насчитывает более 50 компонентов, многие из которых до сих пор не изучены. Прополис нашел широкое применение в фармакологии и народной медицине как в чистом виде так и в форме различных настоек. Спиртовой экстракт прополиса часто используется в косметологии.",
        effects: ["Антивозрастное", "Питание кожи", "Антисептическое", "Бактерицидное", "Против перхоти", "Противовирусное", "Антиакне", "Противовоспалительное", "Антиоксидантное", "Питание волосяных луковиц", "Придает блеск волосам", "Противогрибковое", "Стимулирует рост волос"]
      }, {
        name: "ROYAL JELLY",
        allergen: true,
        description: "Белая киселеобразная жидкость с кислым вкусом и имеет очень сложный состав. Очень богата питательными веществами и хорошо сбалансированной композицией. Обладает бактериостатическим, бактерицидным, противовирусным, антитоксическим действием, улучшает обмен веществ, тонизирует. Способствует регенерации клеток, улучшает структуру кожи. В косметике используется в довольно широко в средствах для кожи, особенно увядающей. Экстракт сохраняет все нативные свойства нативного молочка.",
        effects: ["Бактерицидное", "Противовирусное", "Регенерация кожи", "Тонизирует кожу", "Противовоспалительное"]
      }]
    }
    ]
  }
]

litle_arr = Array.new

def new_objects(old, fresh)

  all_objects = old.all
  old_objects = Array.new

  all_objects.each do |k, v|
    old_objects.push(k.name)
  end
  new_objects = (old_objects | fresh) - old_objects

  return new_objects

  new_objects.each do |object|
    n = old.create!(name: object)
  end
end

brands.each do |brand|
  b = Brand.create!(name: brand[:name], logo: brand[:logo], description: brand[:description])
  puts b.name

  brand[:product].each do |product|
     pr = Product.create!(brand_id: b.id, name: product[:name], view: product[:view], description: product[:about], image: product[:image])
     puts pr.name

     product[:structure].each do |component|
       i = 0
       if Component.all.count == 0
         c = Component.create!(name: component[:name], allergen: component[:allergen], description: component[:description])
         puts c.name
       else
         Component.all.each do |ob|
           if (component[:name] != ob.name) && i==0
             puts "#{component[:name]} и  #{ob.name} не равны".colorize(:green)
             uppi = Component.create(name: component[:name], allergen: component[:allergen], description: component[:description])
             i = i + 1
             # puts uppi.name
           end
         end
       end
     end

     product[:structure].each do |component|

       puts product[:name]

       component[:effects].each do |effect|
         litle_arr.push(effect)
       end

     end

     new_objects(ActiveEffect, litle_arr)

     product[:structure].each do |component|
       comp = Component.find_by name: component[:name]

       Structure.create!(component_id: comp.id, product_id: pr.id)
       puts "связь #{comp.name} и #{pr.name}"
       component[:effects].each do |effect|
         ef = ActiveEffect.find_by name: effect
         Property.create!(active_effect_id: ef.id, component_id: comp.id)
         puts "связь #{ef.name} и #{comp.id}"
       end
     end

     puts product[:promist_effests]

     product[:promist_effests].each do |promist|
       ef = ActiveEffect.find_by name: promist

       if ef == nil
         puts "элемента #{promist} не существует".colorize(:red)
       else
        ob = ProductPromise.create!(active_effect_id: ef.id, product_id: pr.id)
        puts "связь #{ef.name} и #{pr.id}"
       end
    end
  end
end


articles = [
  {
    header: "Поговрим об эфирных маслах",
    description: "Тема эфирных масел лежит в самом сердце косметической продукции. Именно благодаря им продукты прекрасно пахнут и дарят приятные ощущения. Но что они из себя представляют, как работают и откуда берутся?",
    content: "Их часто считают просто чем-то приятно благоухающим, покупают
    во флакончиках и хранят в шкафу над раковиной, но эфирные масла — это нечто намного большее. Они в буквальном смысле суть тех растений,
    из которых они происходят. Но они не просто пахнут великолепно, они полны пользы для вашего разума, тела и души, и именно по этой причине их используют на протяжении многих веков."
  }, {
    header: "Интересные факты о загаре",
    description: "Издавна загар считался уделом бедняков, в мое долгое время была «аристократическая» бледность. Ситуацию изменила Коко Шанель, забывшая о защите от солнца и вернувшаяся со Средиземного моря с золотистым загаром. С тех пор загар считается признаком красоты и сексуальности.",
    content: "Вместе с меланином начинается и выработка витамина D — гаранта крепких костей и здоровой мускулатуры. Как не парадоксально, но чрезмерное пребывание на солнце наоборот становится причиной повышенной хрупкости костей, ослабляя общий иммунитет. Поэтому 10-15 минут солнечных ванн в день будет вполне достаточно для поддержания здоровья. Для получения солнечного ожога хватит и десяти лишних минут. Появление загара можно стимулировать и с помощью пигментов, содержащихся в продуктах питания. Так поедание моркови и абрикосов, богатых каротином, помогут придать коже легкий золотистый оттенок.От солнца зависит нормирование не одного десятка функций организма. Самый заметный удар отсутствие солнечных ванн наносит на иммунитет и психологическое здоровье. Депрессии, подавленность и бесконечные простуды — главные спутники холодных времен года."
  }, {
    header: "Здоровая кожа - секреты и советы. ",
    description: "Как на самом деле должна выглядеть по-настоящему здоровая кожа? Основные признаки: излучает сияние, чистоту, свежесть, она буквально светится от счастья. С такой кожей у Вас есть повод радоваться жизни!  Но, тем не менее, кожа каждого человека в отдельности имеет индивидуальные потребности и особенности, существует 5 общих основных базовых правил, выполнение которых обязательно для сохранения здоровья любой кожи. Добавьте их в свой ежедневный план ухода сегодня и Вы будете выглядеть ослепительно!
    ",
    content: "Ранняя весна – лучшее время для тёплых согревающих напитков: пряных латте, горячего шоколада и фруктовых коктейлей. В тоже время, большое количество сахара, соли, кофеина и алкоголя могут негативно отразиться на вашей коже.  Алкоголь, желательно, совсем исключить из своей жизни, как и табак и другие вредные привычки. Для того, чтобы сбалансировать свой весенний рацион, увеличьте потребление воды! Выпивая около 9-10 стаканов по 200 мл ежедневно, Вы сможете защитить кожу от обезвоживания, которое может стать причиной избыточной продукции себума, появления воспалительных элементов, раздражения или шелушения, а иногда и всех этих проявлений сразу!
    Пить лучше чистую родниковую воду. Нужно понимать, что вода из под крана, а также кипячённая - это все мёртвая вода. Также не рекомендуется злоупотреблять кофейными напитками, чёрным чаем и газировками.

    Советы экспертов: для поддержания оптимального баланса увлажнения Вашей кожи возьмите с собой бутылку воды и Тонер мультиактивный / Multi Active Toner 250 мл (от компании dermalogica) куда бы Вы ни направились."
  }, {
    header: "Правильный уход за жирной кожей лица",
    description: "В статье речь пойдёт о моём опыте по уходу за жирной и проблемной кожей лица. Я раскрываю наиболее частые ошибки, привожу эффективные рецепты скрабов и масок для проблемной кожи, которые элементарно можно делать и применять в домашних условиях.",
    content: "Уход за жирной и проблемной кожей лица должен быть комплексным и эффективным. Для этого нужно регулярно применять маски для лица, очищать кожу тоником и лосьоном, делать пилинг лица, с помощью специальных скрабов, а также использовать крем против прыщей.

    До лет 14-15 у меня совершенно не возникало проблем с кожей лица. Но после 14 лет, начался бурный процесс полового созревания. Вот тогда я в полной мере ощутила на себе все прелести «счастливой» обладательницы жирной кожи. В этой статье я хочу поделиться проверенными на себе советами по уходу за жирной проблемной кожей лица. Дам действительно работающие рекомендации, проверенные на своём жизненном опыте. Возможно, что кто-то ими решит воспользоваться и сможет избежать множества ошибок"
  }
]

articles.each do |article|
  Article.create!(header: article[:header], description: article[:description], content: article[:content])
end
